ERP.belugaerp/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Организации</name>
  <objectBelonging>Adopted</objectBelonging>
  <predefined>
    <items>
      <name>УправленческаяОрганизация</name>
      <description>Управленческая организация</description>
    </items>
  </predefined>
  <attributes>
    <name>бг_АвтозаполнениеБанковскихГарантий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВестиУчетАкцизовПоПриобретеннымЦенностям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ДатаНачалаУчетаАкцизовПоПриобретеннымЦенностям</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодSAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_КодНСИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_МинимальнаяОтпускнаяЦена</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПроверятьЗаполнениеТранспортнойИнформацииПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ПродажаАлкогольнойПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяСписанияНормативныхПотерьПоАкцизам</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтатьяСписанияТехнологическихПотерь</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/CommonModules/ВводОстатковСервер/Module.bsl
#Область ПрограммныйИнтерфейс
#Область ПереопределяемыеПроцедуры
	
&Вместо("СформироватьДокументыВводаОстатковПоДаннымОперативногоУчета")
Процедура бг_СформироватьДокументыВводаОстатковПоДаннымОперативногоУчета(Параметры, АдресХранилища) Экспорт
	
	ДатаВвода                       = Неопределено;
	ОтражатьВБУиНУ                  = Ложь;
	ОтражатьВУУ                     = Ложь;
	СозданныеДокументыВводаОстатков = Новый Массив;
	
	Если Параметры.Свойство("ДатаВвода") Тогда
		ДатаВвода = Параметры.ДатаВвода;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВвода) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтражатьВБУиНУ") Тогда
		ОтражатьВБУиНУ = Параметры.ОтражатьВБУиНУ;
	КонецЕсли;
	
	Если Параметры.Свойство("ОтражатьВУУ") Тогда
		ОтражатьВУУ = Параметры.ОтражатьВУУ;
	КонецЕсли;
	
	Если Не ОтражатьВБУиНУ И Не ОтражатьВУУ Тогда
		Возврат;
	КонецЕсли;

	ПараметрыЗаполненияОстатков = Новый Структура;
	ПараметрыЗаполненияОстатков.Вставить("ОтражатьВБУиНУ", ОтражатьВБУиНУ);
	ПараметрыЗаполненияОстатков.Вставить("ОтражатьВУУ", ОтражатьВУУ);
	
	Если Параметры.Свойство("МассивХозяйственныхОпераций") Тогда
		ДоступныеХозяйственныеОперации = Параметры.МассивХозяйственныхОпераций;
	Иначе
		ПараметрыОтбораХозяйственныхОпераций = ИнициализироватьПараметрыОтбораДоступныхХозяйственныхОпераций();
		ДоступныеХозяйственныеОперации       = ДоступныеХозяйственныеОперации(ПараметрыОтбораХозяйственныхОпераций);
	КонецЕсли;
	
	Организации = Новый Массив;
	
	Если Не Параметры.Свойство("Организации", Организации) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Организации.Ссылка КАК Организация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	НЕ Организации.ПометкаУдаления
			|	И (&Организации = НЕОПРЕДЕЛЕНО
			|			ИЛИ Организации.Ссылка В (&Организации))
			|	И (Организации.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
			|			ИЛИ &УчитыватьУпрОрганизацию)");
		
		Запрос.УстановитьПараметр("Организации",                            Организации);
		Запрос.УстановитьПараметр("УчитыватьУпрОрганизацию", ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюОрганизацию"));
		
		Организации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		
	КонецЕсли;

	НомерПоПорядку = 0;
	ВсегоОбъектов  = ДоступныеХозяйственныеОперации.Количество();
	
	Для Каждого ХозяйственнаяОперация Из ДоступныеХозяйственныеОперации Цикл
		
		НомерПоПорядку    = НомерПоПорядку + 1;
		ПроцентВыполнения = Окр(100 * НомерПоПорядку / ВсегоОбъектов);
		
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
		
		ДокументВводаОстатков                      = ОпределитьДокументПоХозяйственнойОперации(ХозяйственнаяОперация);
		ДокументОтражаетсяВРегламентированномУчете = ДокументОтражаетсяВРегламентированномУчете(ДокументВводаОстатков);
		
		Если Не ДокументОтражаетсяВРегламентированномУчете Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерДокумента              = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ДокументВводаОстатков).ПолноеИмя());
		ОстаткиПоХозяйственнойОперации = МенеджерДокумента.ОстаткиПоТипуОперации(ДатаВвода, ХозяйственнаяОперация, Организации,, ПараметрыЗаполненияОстатков);
		ПоляСравнения                  = МенеджерДокумента.КлючевыеПоляРеглУчетаПоТипуОперации(ХозяйственнаяОперация);
		
		Если ОстаткиПоХозяйственнойОперации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументВводаНачальныхОстатков = Неопределено; // ДокументОбъект
		
		Для Каждого СтрокаТаблицы Из ОстаткиПоХозяйственнойОперации Цикл
			
			Если КлючевыеПоляОтличаются(ДокументВводаНачальныхОстатков, СтрокаТаблицы, ПоляСравнения) Тогда
				
				Если Не ДокументВводаНачальныхОстатков = Неопределено Тогда
					ДокументВводаНачальныхОстатков.Записать(РежимЗаписиДокумента.Запись);
					СозданныеДокументыВводаОстатков.Добавить(ДокументВводаНачальныхОстатков.Ссылка);
				КонецЕсли;
				
				ДокументВводаНачальныхОстатков = МенеджерДокумента.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(ДокументВводаНачальныхОстатков, СтрокаТаблицы);
				
				ДанныеЗаполнения = ИнициализироватьЗначенияЗаполненияДокументаВводОстатков();
				ДанныеЗаполнения.Дата           = ДатаВвода;
				ДанныеЗаполнения.Ответственный  = Пользователи.ТекущийПользователь();
				ДанныеЗаполнения.ОтражатьВБУиНУ = ОтражатьВБУиНУ;
				ДанныеЗаполнения.ОтражатьВУУ    = ОтражатьВУУ;
				ДанныеЗаполнения.Комментарий    = НСтр("ru = '#Ввод остатков по данным оперативного учета.';
														|en = '#Enter balance by operational accounting data.'");
// Вставка
				Если ТипЗнч(ДокументВводаНачальныхОстатков) = Тип("ДокументОбъект.ВводОстатковВзаиморасчетовПоАренде") Тогда
					Продолжить;
				КонецЕсли;				
// КонецВставки
				ЗаполнитьЗначенияСвойств(ДокументВводаНачальныхОстатков, ДанныеЗаполнения, , "ХозяйственнаяОперация, Организация");
				
				ТабличнаяЧастьДокумента   = СтрокаТаблицы.ЗаполняемаяТабличнаяЧасть;
				ЗаполняемаяТабличнаяЧасть = ДокументВводаНачальныхОстатков[ТабличнаяЧастьДокумента]; //ТабличнаяЧасть
				
			КонецЕсли;
			
			СтрокаТабличнойЧасти = ЗаполняемаяТабличнаяЧасть.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТаблицы);
			
		КонецЦикла;
		
		Если Не ДокументВводаНачальныхОстатков = Неопределено Тогда
			ДокументВводаНачальныхОстатков.Записать(РежимЗаписиДокумента.Запись);
			СозданныеДокументыВводаОстатков.Добавить(ДокументВводаНачальныхОстатков.Ссылка);
		КонецЕсли;
			
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СозданныеДокументыВводаОстатков, АдресХранилища);
	
КонецПроцедуры
	
#КонецОбласти
#КонецОбласти
